tests/cassettes/test_webservice.test_rms_order.yaml

interactions:
- request:
    body: "<?xml version='1.0' encoding='utf-8'?>\n<soap-env:Envelope xmlns:soap-env=\"\
      http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap-env:Body>\n    <ns0:getRequestId\
      \ xmlns:ns0=\"http://orderapi.rms.rakuten.co.jp/rms/mall/order/api/ws\">\n \
      \     <arg0>\n        <authKey>XXXXXX</authKey>\n        <shopUrl></shopUrl>\n\
      \        <userName></userName>\n      </arg0>\n    </ns0:getRequestId>\n  </soap-env:Body>\n\
      </soap-env:Envelope>\n"
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['476']
      Content-Type: [text/xml; charset=utf-8]
      SOAPAction: ['""']
      User-Agent: [python-requests/2.12.0]
    method: POST
    uri: https://api.rms.rakuten.co.jp/es/1.0/order/ws
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA3WQO07DQBCGr2KlcZWdtSUky1pvJBBINBQJHGBljxyD98HOOkBLwUWoKZEizsPj
        GqyVGFd0v77555+HWD3qPtmhp86aKs0YTxM0tW0601bpzfXFskhXUmzKc7PD3jpMot9QuakW2xBc
        CUD1FrUiFjlZ5Zj1LYwC8NgBi7H/1DZPUhjKyxbDGu8HpHDZrJGcNTSlxvJfrvUNeuU65jUxr+6G
        gIbVlt06iAS06vuDB6IJHihO8RgGb6RA760/sw3KK86XnHMBMxIaiVSL8vvt9Wu//3l//vx4ETDR
        GHLcTWYF50V2kucCZjjqwxT475hYmu6F+XHyF2ZhWU1rAQAA
    headers:
      Connection: [close]
      Content-Encoding: [gzip]
      Content-Length: ['264']
      Content-Type: [text/xml;charset="utf-8"]
      Date: ['Mon, 28 Nov 2016 17:56:04 GMT']
      Server: [nginx]
      Vary: [Accept-Encoding]
      X-Powered-By: [Servlet/2.5 JSP/2.1]
      requestId: [a71fc89b-5202-4b0b-b749-f686503ea1af]
      timeStamp: ['2016-11-28T17:56:04']
    status: {code: 200, message: OK}
version: 1
